In [37]:
import pandas as pd
from sklearn.datasets import fetch_california_housing

In [38]:
data = fetch_california_housing(as_frame= True).frame

In [39]:
# which means of getting 5 first rows we can set amount of rows too in the .head()
data.head(10)

# which is for getting 5 last rows  and we can set amount of rows in the .tail()
data.tail()

       MedInc  HouseAge  ...  Longitude  MedHouseVal
20635  1.5603      25.0  ...    -121.09        0.781
20636  2.5568      18.0  ...    -121.21        0.771
20637  1.7000      17.0  ...    -121.22        0.923
20638  1.8672      18.0  ...    -121.32        0.847
20639  2.3886      16.0  ...    -121.24        0.894

[5 rows x 9 columns]

In [40]:
# .sample for picking up an random row  also we can set an amount .sample()
data.sample()

       MedInc  HouseAge  ...  Longitude  MedHouseVal
14561  5.7451      17.0  ...    -117.22        2.373

[1 rows x 9 columns]

In [41]:
# data.columns   # gives u the names of columns

data = list(data.columns) # it will just give u the columns name in the list format

In [42]:
# display limit
pd.options.display.max_columns =5

data

['MedInc',
 'HouseAge',
 'AveRooms',
 'AveBedrms',
 'Population',
 'AveOccup',
 'Latitude',
 'Longitude',
 'MedHouseVal']

In [43]:
# for getting the "info()" in a concise manner

data.info()

AttributeError: 'list' object has no attribute 'info'

In [ ]:
# Summarize  format
data.describe()

             MedInc      HouseAge  ...     Longitude   MedHouseVal
count  20640.000000  20640.000000  ...  20640.000000  20640.000000
mean       3.870671     28.639486  ...   -119.569704      2.068558
std        1.899822     12.585558  ...      2.003532      1.153956
min        0.499900      1.000000  ...   -124.350000      0.149990
25%        2.563400     18.000000  ...   -121.800000      1.196000
50%        3.534800     29.000000  ...   -118.490000      1.797000
75%        4.743250     37.000000  ...   -118.010000      2.647250
max       15.000100     52.000000  ...   -114.310000      5.000010

[8 rows x 9 columns]

In [ ]:
# to get Particular column information u can do like this
data.HouseAge

# or 
data['HouseAge']

# this will give u a series of that column

0        41.0
1        21.0
2        52.0
3        52.0
4        52.0
         ...
20635    25.0
20636    18.0
20637    17.0
20638    18.0
20639    16.0
Name: HouseAge, Length: 20640, dtype: float64

Statical data & plotting

In [ ]:
# now by doiing this we can run statical function or can say do analytical stuff

#mean
data.HouseAge.mean()

#minimum 
data.HouseAge.min()

#maximum
data.HouseAge.max()

#mode
data.HouseAge.mode()

#median
data.HouseAge.median()

#standard deviation
data.HouseAge.std()

#sum 
data.HouseAge.sum()

#count
data.HouseAge.count()

In [ ]:
#Visualisation stuff
import matplotlib.pyplot as plt

# Histogram or plot various visulaizatioon 
data.HouseAge.hist()
plt.title('House Age')
plt.show()


# now for full data set histogram as example we can 
# show it nicely like this

data.hist(figsize=(12,8))
plt.tight_layout()

In [49]:
data1 = pd.DataFrame({
    'name' : ['Mike', 'Alice' , 'Bob'],
    'age'  : [30,40,50],
    'job'  : ['Programmer','Designer','Accountant']
})

In [50]:
data1

    name  age         job
0   Mike   30  Programmer
1  Alice   40    Designer
2    Bob   50  Accountant

In [51]:

data1 = data1.set_index('name')

Accessing Indivdual cells

.loc[] , .at[] -> this is for getting info and making Changess!!

In [52]:
# This is how we take a particular row 
data1.loc['Alice']

# or 

data1.iloc[1]

age          40
job    Designer
Name: Alice, dtype: object

In [53]:
# To select specific field (row and column)
data1.loc['Alice' , 'age']

# or 
data1.iloc[1,0]

np.int64(40)

In [ ]:
# to get specific value  , it can't handle two many info
data1.at['Alice' , 'age']

# or

data1.iat[1,0]

np.int64(40)

In [54]:
# change the specific value 
data1.at['Alice', 'age'] = 60

In [55]:
data1

       age         job
name
Mike    30  Programmer
Alice   60    Designer
Bob     50  Accountant

In [56]:
data1.loc['Mike'] = [75, 'clerk']

In [ ]:
data1

       age         job
name
Mike    75       clerk
Alice   60    Designer
Bob     50  Accountant

In [57]:
# Append with loc

data1.loc['jhon'] =[90, 'Teacher']

In [58]:
data1

       age         job
name
Mike    75       clerk
Alice   60    Designer
Bob     50  Accountant
jhon    90     Teacher

In [ ]:
# data1.iloc[0:3]   # acessing particular first rows

 Manipulating Data (Applying Functions)

In [ ]:
#data1.age**2 # this represenation for without saving in data1 to save

# data1.age =  data1.age *2

In [ ]:
# data1

In [59]:
# doing some greater conditional stuff

def myfunction(x):
    if x % 3 == 0:
        return x ** 2
    else:
        return x//2

In [60]:
def function2(x):
    if x.endswith('r'):
        return 'without job'
    else: 
        return x

In [ ]:
data1.age = data1.age.apply(myfunction)

In [ ]:
data1.job = data1.job.apply(function2)

In [ ]:
data1

       age          job
name
Mike    75        clerk
Alice   60  without job
Bob     50   Accountant
jhon    90  without job

In [61]:
data1['summary'] =  data1.apply(lambda row: f'Age: {row["age"]}, job: {row["job"]}', axis =1)

In [62]:
data1.drop('summary', axis=1)

       age         job
name
Mike    75       clerk
Alice   60    Designer
Bob     50  Accountant
jhon    90     Teacher

In [63]:
# Dropiing a row
data1.drop(['age', 'job'] ,  axis=1)

                        summary
name
Mike        Age: 75, job: clerk
Alice    Age: 60, job: Designer
Bob    Age: 50, job: Accountant
jhon      Age: 90, job: Teacher

DATA cleaning...

In [64]:
data1.info()

<class 'pandas.DataFrame'>
Index: 4 entries, Mike to jhon
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   age      4 non-null      int64
 1   job      4 non-null      str
 2   summary  4 non-null      str
dtypes: int64(1), str(2)
memory usage: 300.0+ bytes

In [69]:
# invalid values 

data1.at['Alice', 'age'] =  float('nan')

data1

        age         job                   summary
name
Mike   75.0       clerk       Age: 75, job: clerk
Alice   NaN    Designer    Age: 60, job: Designer
Bob    50.0  Accountant  Age: 50, job: Accountant
jhon   90.0     Teacher     Age: 90, job: Teacher

In [ ]:
# to handle the null value is to drop them or to fill them
data1